---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyDistance
source: html/990766c4-1042-f5e3-6ee2-683b70dcb8ab.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDistance

Represents a property of material.

## Syntax (C#)
```csharp
public class AssetPropertyDistance : AssetProperty
```